{
  "fgColor": "#1ab26b",
  "metrics": [
    {
      "value": "500",
      "title": "Althusser Competing"
    },
    {
      "value": "255 <span>K</span>",
      "title": "Not Just One State"
    },
    {
      "value": "20 <span>M</span>",
      "title": "An Ugly Myspace Profile"
    },
    {
      "value": "30 <span>M+</span>",
      "title": "Kindness And Motivation"
    }
  ],
  "contentLeft": "<p>When I was a young man, even a teenager for that matter, I always had an optimism that was hard for others to overcome. Even in the midst of the all the negative influences from family and peers, this positive optimism was difficult to beat down. I was powerful, I was lucky, life was magic. I remember it like it was yesterday.</p><p>It didn’t matter how many times I was chased home. It didn’t matter how many times the girls bullied me. It didn’t matter how many times my father beat me. It didn’t matter how many times the teachers picked on me. I just knew; This is not it! There is more greatness to come!</p><p><a href=''>When I was kicked out</a> and made to join the military, I wasn’t feeling particularly lucky at that time but I still had that positive attitude. Sure there was grief, and I knew, I just knew that there were still great things to come. I did my military service and got out and that pervasive optimism, while struggling for a while arose and pulled me into the most amazing journey within another set of circumstances that saw many wonderful things happen.</p><p>As I remember, my body begins to remember. There is an energy that lives inside the memory, it’s not just the mind. I am lucky. Life is good. Great things will happen. This is exciting. What next? Bring it on. Even when the bad stuff happens, it’s acceptance was easy. “Okay, that’s okay, this will pass and even greater things are coming.” That’s all I had to say. More often than not, these statements have proven true, time and time again.</p><p><a href=''>It’s the power</a> of your mind and body. The power of belief. The power of faith. The power of trusting. It’s inside – not outside. Energize yourself, your body, your mind, keep checknig in, keeping boosting yourself. It’s a game and so is life. There are no winners and losers; just you. Abundance is everywhere, there is plenty of love, money, opportunities, peace, and more to go around! Change the way you look at things and the things you look at will change.</p><p>I’m writing this today from the memory that has come alive in my body, not just a mind-memory. The outcome has been new friends, new opportunities, new clients, new energy, new aliveness, joy, and happiness. Not just with life – even more – with me, my purpose, my talent and gifts, and the embracing of this knowledge and truth. If you find yourself strugglnig with those truths of yourself, look at the negative influences that pull you from peace and eliminate them from your life. Better to be alone and soar like an eagle than to be in the company of oppressors and jealousy that robs you of your magic, your inspiration, your value, your purpose, and your life.</p><p>A victim no longer, take responsibility for the choices, the people, the actions, that are keeping you prisoner to your fears. Time for freedom, for love, for magic, for purpose and passion. Live out loud! Love freely!</p><p>It’s the power of your mind and body. The power of belief. The power of faith. The power of trusting. It’s inside – not outside. Energize yourself, your body, your mind, keep checknig in, keeping boosting yourself. It’s a game and so is life. There are no winners and losers; just you. Abundance is everywhere, there is plenty of love, money, opportunities, peace, and more to go around! Change the way you look at things and the things you look at will change.</p>",
  "contentRight": "<h3 class='h3'>When I was a young man, even  a teenager for that matter:</h3><ul><li>I always had an optimism that was hard for others to overcome</li><li>Even in the midst of the all the negative influences from family and peers,</li><li>This positive optimism was difficult to beat down.</li><li>I was powerful I was lucky, life was magic. I remember it like it was yesterday.</li></ul><h3 class='h3'>When I was a young man:</h3><ul><li>I always had an optimism that was hard for others to overcome</li><li>Even in the midst of the all the negative influences from family and peers,</li><li>This positive optimism was difficult to beat down.</li><li>I was powerful I was lucky, life was magic. I remember it like it was yesterday.</li></ul>",
  "colorText": "I always had an optimism that was hard for others to overcome. Even in the midst of the all the negative influences from family and peers. This positive optimism was difficult to beat down. I was powerful. I was lucky, life was magic. I remember it like it was yesterday. It didn’t matter how many times I was chased home. It didn’t matter how many times the girls bullied me. It didn’t matter how many times my father beat me."
}