{
  "title": "Changing Your Business as the Industry Changes. Ride the Waves When You Can but Make Sure You Are Ready When the Wave Ends.",
  "textBlob": "\u003cp\u003eOn today\u0026rsquo;s episode, find out how one entrepreneur was able to overcome the roller coaster events in his life. Kevin Hourigan sits down with Jon and shares his company\u0026rsquo;s struggles, victories, recline, and regrowth. He is the President and CEO of Bayshore Solutions, a leading Digital Advertising Agency. Tune in as Kevin discuss how he handles these transitions and adjusts accordingly when the waves end.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp style=\u0022text-align: center;\u0022\u003e\u003cstrong\u003e\u0026ldquo;When you\u0027re losing so much, getting to profitability seemed like a huge victory.\u0026rdquo;\u003c/strong\u003e\u003c/p\u003e\n\u003cp style=\u0022text-align: center;\u0022\u003e\u003cstrong\u003e-Kevin Hourigan\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cbr /\u003eTimestamps:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e01:17 - How Kevin started his company, the Bayshore Solutions,\u0026nbsp; at the time when websites are not yet known or seen as needed.\u003c/p\u003e\n\u003cp\u003e04:04 - Their struggles at the beginning and how they grew so fast in 3-4 year mark as companies realize the importance of websites (dot-com bubble boom)\u003c/p\u003e\n\u003cp\u003e06:19 - The downfall of his company after the dot-com bubble burst, how they bounce back, who among their clients managed to survived the downfall current and why\u003c/p\u003e\n\u003cp\u003e10:48 - What Kevin thought happened at the dot-com bubble and how he and his employees reacted and handled the changes in the industry\u003c/p\u003e\n\u003cp\u003e16:30 - Why denial phase could be a silent killer and why it\u0027s important to accept what\u0027s happening and adjust\u003c/p\u003e\n\u003cp\u003e18:55 - Why Kevin rebrand his company and hired co-worker and customers that are willing to let go of the past and how they became successful\u003c/p\u003e\n\u003cp\u003e20:46 - Two lessons that Kevin learned from all the events that happened and where it leads him and his company today\u003c/p\u003e\n\u003cp\u003e24:10 - The vision, expertise, and values of Bayshore Solutions\u0026nbsp; that will enable them to be ready for any shift or unexpected things to come and help their clients grow their businesses\u003c/p\u003e\n\u003cp\u003e27:36 - How to be innovative not at the client\u0027s expense and why Kevin\u0027s company doesn\u0027t work with vertical markets\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cbr /\u003eResources:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cu\u003e\u003ca href=\u0022https://en.wikipedia.org/wiki/Dot-com_bubble\u0022 target=\u0022_blank\u0022 rel=\u0022noopener\u0022\u003eDot-com bubble\u003c/a\u003e\u003c/u\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u0026nbsp;Connect with Kevin:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cu\u003e\u003ca href=\u0022https://www.bayshoresolutions.com/\u0022 target=\u0022_blank\u0022 rel=\u0022noopener\u0022\u003ebayshoresolutions.com\u003c/a\u003e\u003c/u\u003e\u003c/li\u003e\n\u003cli\u003e\u003cu\u003e\u003ca href=\u0022https://twitter.com/hourigankev?lang=en\u0022 target=\u0022_blank\u0022 rel=\u0022noopener\u0022\u003eTwitter\u003c/a\u003e\u003c/u\u003e\u003c/li\u003e\n\u003cli style=\u0022text-align: left;\u0022\u003e\u003cu\u003e\u003ca href=\u0022https://www.linkedin.com/in/kevinhourigan/\u0022 target=\u0022_blank\u0022 rel=\u0022noopener\u0022\u003eLinkedIn\u003c/a\u003e\u003c/u\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cbr /\u003eTranscript:\u003c/strong\u003e\u003cu\u003e\u003c/u\u003e\u003cu\u003e\u003c/u\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eIntro: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eWelcome to Agile Living, The Entrepreneur\u0027s Journey. A show dedicated to discovering how entrepreneurs and digital leaders are doing more with less. I\u0027m Jon Voigt, your host and CEO of Agility. And we\u0027re on a journey across the country to learn from top digital entrepreneurs on how to live a more agile, adaptable, and fulfilling life. Thank you for joining me today. And let\u0027s dive in.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eJon Voigt: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eToday we have Kevin Hourigan on the show. Kevin is the President and CEO of Bayshore Solutions. Kevin has been at the helm for 23 years and has seen lots of changes in his business and the industry. We were talking about some of these big changes that happened over the years and it\u0027s amazing any business stayed around for so long even with all the major changes across all industries. On this podcast, I wanted to have Kevin on the show to talk about these transformations and speak about his business being able to redefine itself to keep providing top solutions through all the ups and downs. Kevin, it\u0027s great to have you on the show.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eKevin Hourigan: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eWell thank you. It\u0027s a pleasure to be on the show.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eJon Voigt: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eI\u0027d love for you to start all the way at the beginning. You know talk about some of the big swings the business went through and then maybe lead into where you\u0027re taking it now to kind of stay relevant as things continue to change.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eKevin Hourigan: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eWell that\u0027s great Jonathan. My company started, Bayshore Solutions, we started twenty-three years ago as a web design and web development company. And in taking you back twenty-three years ago to January 1996 America Online or AOL as you may remember it was on Version 1. And at the time I had a company that was what you might call a network integrator. We went into local businesses in the Tampa Bay market where I lived and we would help them manage their workstations and their servers and make sure their employees could use those computers every day. And we had an idea that we would start to offer these people their first website ever. And January 1996 as we went to our existing customer base and offered them their first website ever which was going to be a three-page website for five hundred dollars, we immediately were faced with two common questions. The first question was, what is a website? And the second one was less of a question, it was more of a statement it was, we\u0027ll never need one of those. And that\u0027s when we got started at Bayshore Solutions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eJon Voigt: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eWow it\u0027s so crazy to flip back to that time where the Internet was questioned.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eKevin Hourigan: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eVery much so. Very much so. The tides shifted for years later and those companies who said what is one or we\u0027ll never need one, where banging down our door changing their mind. But that\u0027s when we got started and kind of consider ourselves, for lack of a better phrase, kind of a grandfather oak tree in the Internet space. As we continued to grow and then move in this industry, one of the things we later learned is 98 percent of the companies that were in the Internet services space before the year 2000 are no longer in business today. So, we feel very fortunate to be one of the two percent who survived the crazy times of getting started when no one had belief, and on the crazy times when the dot-com bubble later pre-did and the adoption of the Internet to greater than what it actually could provide results back to. And then the implosion of the dot-com bubble so to speak, and the fallout of that is part of our journey that certainly has given us a lot of experience. And that experience has given us a lot of ingredients to still be here twenty-three years later in an industry that still is the wild wild west from trying to determine what your five-year vision is in this industry. Still at twenty-three years deep it is difficult just because of the rapid change that the marketplace has.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eJon Voigt: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eYeah definitely it\u0027s hard to plan out in five years when in two years that direction can pivot completely.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eKevin Hourigan: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eAbsolutely.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eJon Voigt: \u003c/span\u003e\u003c/strong\u003e\u003cspan\u003eI know, you were talking about the dot-com bubble and some you know big huge climb of the company and then a shrink of the company. ",
  "episodeNumber": 19,
  "url": "changing-your-business-as-the-industry-changes-ride-the-waves-when-you-can-but-make-sure-you-are-ready-when-the-wave-ends",
  "date": "2019-01-23T00:00:00",
  "guest": "Kevin Hourigan",
  "excerpt": "\u003cp\u003eOn today\u0026rsquo;s episode, find out how one entrepreneur was able to overcome the roller coaster events in his life. Kevin Hourigan sits down with Jon and shares his company\u0026rsquo;s struggles, victories, recline, and regrowth. He is the President and CEO of Bayshore Solutions, a leading Digital Advertising Agency. Tune in as Kevin discusses how he handles these transitions and adjusts accordingly when the waves end.\u003c/p\u003e",
  "embed": "\u003ciframe style=\u0022border: none\u0022 src=\u0022//html5-player.libsyn.com/embed/episode/id/8262425/height/50/theme/legacy/autoplay/no/autonext/no/thumbnail/no/preload/no/no_addthis/no/direction/backward/\u0022 height=\u002250\u0022 width=\u0022100%\u0022 scrolling=\u0022no\u0022  allowfullscreen webkitallowfullscreen mozallowfullscreen oallowfullscreen msallowfullscreen\u003e\u003c/iframe\u003e",
  "mainImage": {
    "url": "https://static.agilitycms.com/podcast/EP 19 - Featured Image_20190115101741_0.png",
    "label": ""
  },
  "listingImage": {
    "url": "https://static.agilitycms.com/podcast/EP 19 - SM Image 1 Resized_20190115101749_0.png",
    "label": ""
  },
  "referenceName": "Podcast",
  "key": 450
}