{
  "title": "Put Wings On Your Dreams",
  "subTitle": "Researchers believe that developing A SENSE OF PURPOSE is a strategy which can ENHANCE HEALTHY LIVING.",
  "video": {
    "url": "http://html5-player.libsyn.com/embed/episode/id/8157878/height/50/theme/legacy/autoplay/yes/autonext/no/thumbnail/yes/preload/no/no_addthis/no/direction/backward/"
  },
  "title": "Put Wings On Your Dreams",
  "authorName": "Episod #1",
  "text": "<p>There are many kinds of narratives and organizing principles. Science is driven evidence gathered in experiments, and by the falsification of extant theories and their replacement with newer, asymptotically truer, ones..</p><p>Other systems – religion, nationalism, paranoid ideation, or art – are based on personal experiences (faith, inspiration, paranoia, etc.).</p><p>Experiential narratives can and do interact with evidential narratives and vice versa. For instance: belief in God inspires some scientists who regard science as a method to “peek at God’s cards” and to get closer to Him. Another example: the pursuit of scientific endeavors enhances one’s national pride and is motivated by it. Science is often corrupted in order to support nationalistic and racist claims.</p><p>The basic units of all narratives are known by their effects on the environment. God, in this sense, is no different from electrons, quarks, and black holes. All four constructs cannot be directly observed, but the fact of their existence is derived from their effects.</p><p>Granted, God’s effects are discernible only in the social and psychological (or psychopathological) realms. But this observed constraint doesn’t render Him less “real”. The hypothesized existence of God parsimoniously explains a myriad ostensibly unrelated phenomena and, therefore, conforms to the rules governing the formulation of scientific theories.</p><em>The locus of God’s hypothesized existence is, clearly and exclusively, in the minds of believers. But this again does not make Him less real. The contents of our minds are as real as anything “out there”. Actually, the very distinction between epistemology and ontology is blurred.</em><h4 class='h4'>But is God’s existence “true” – or is He just a figment of our neediness and imagination?</h4><p>Truth is the measure of the ability of our models to describe phenomena and predict them. God’s existence (in people’s minds) succeeds to do both. For instance, assuming that God exists allows us to predict many of the behaviors of people who profess to believe in Him. The existence of God is, therefore, undoubtedly true (in this formal and strict sense).</p><p>But does God exist outside people’s minds? Is He an objective entity, independent of what people may or may not think about Him? After all, if all sentient beings were to perish in a horrible calamity, the Sun would still be there, revolving as it has done from time immemorial.</p><p>If all sentient beings were to perish in a horrible calamity, would God still exist? If all sentient beings, including all humans, stop believing that there is God – would He survive this renunciation? Does God “out there” inspire the belief in God in religious folks’ minds?</p><p>Known things are independent of the existence of observers (although the Copenhagen interpretation of Quantum Mechanics disputes this). Believed things are dependent on the existence of believers.</p>",
  "date": "11 Jan 2019 at 11:20 AM"
}