{
  "html": "<h2><strong>The Evaluation Process<\/strong><\/h2>\r\n<p>The team evaluated over 25 CMS packages from a variety of sources, such as:&nbsp;<\/p>\r\n<ul>\r\n<li><a href=\"https:\/\/www.gartner.com\/doc\/3884563\/magic-quadrant-web-content-management\">Gartner Quadrant<\/a><\/li>\r\n<ul>\r\n<li>Industry leading IT consulting firm publishing&nbsp;market research reports that rely on proprietary qualitative data analysis methods to demonstrate market trends, such as direction, maturity <g class=\"gr_ gr_175 gr-alert gr_gramm gr_inline_cards gr_run_anim Punctuation only-ins replaceWithoutSep\" id=\"175\" data-gr-id=\"175\">and<\/g> participants.<\/li>\r\n<\/ul>\r\n<li><a href=\"https:\/\/www.cms-connected.com\/\"><g class=\"gr_ gr_147 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del multiReplace\" id=\"147\" data-gr-id=\"147\">CMS Connected<\/g><\/a><\/li>\r\n<ul>\r\n<li>Tech news and Web Content Management advisory service provider<\/li>\r\n<\/ul>\r\n<li><a href=\"https:\/\/www.g2crowd.com\/categories\/web-content-management\">G2 Crowd<\/a><\/li>\r\n<ul>\r\n<li>Crowd-sourced reviews of business software and services<\/li>\r\n<\/ul>\r\n<li><a href=\"https:\/\/www.cmscritic.com\/\">CMS Critic<\/a><\/li>\r\n<ul>\r\n<li>New and reviews of software, hardware, services such as Content Management Systems, Website Builders, Linux Distributions and more<\/li>\r\n<\/ul>\r\n<li><a href=\"https:\/\/www.techradar.com\/\">Tech Radar<\/a><\/li>\r\n<ul>\r\n<li>Technology news and reviews site<\/li>\r\n<\/ul>\r\n<li><a href=\"https:\/\/financesonline.com\/\">Finances Online<\/a><\/li>\r\n<ul>\r\n<li>Business software reviews<\/li>\r\n<\/ul>\r\n<li><a href=\"https:\/\/www.forbes.com\/sites\/forbestechcouncil\/2018\/06\/28\/traditional-cms-headless-cms-a-hybrid-approach-to-content-management\/#4bbae99a7dd3\">Forbes<\/a><\/li>\r\n<ul>\r\n<li>Business, investing, technology, entrepreneurship site<\/li>\r\n<\/ul>\r\n<\/ul>\r\n<p>Various other reference websites, articles, PDFs, and blogs were also studied extensively during the research process.<\/p>\r\n<p>These references told the team who the industry leaders were and why. From these sources, they culled a list of 25 potential CMS candidates.<\/p>\r\n<ul>\r\n<li>Adobe Experience Manager<\/li>\r\n<li>Agility CMS<\/li>\r\n<li>Brightspot<\/li>\r\n<li>ButterCMS<\/li>\r\n<li>Cloud CMS<\/li>\r\n<li>Contentful<\/li>\r\n<li><g class=\"gr_ gr_154 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del multiReplace\" id=\"154\" data-gr-id=\"154\">Contentstack<\/g><\/li>\r\n<li>CoreDNA<\/li>\r\n<li>Craft<\/li>\r\n<li>CushyCMS<\/li>\r\n<li>DotCMS<\/li>\r\n<li>Drupal<\/li>\r\n<li>ExpressionEngine<\/li>\r\n<li>eZ Platform Cloud<\/li>\r\n<li>Hippo CMS<\/li>\r\n<li>Joomla<\/li>\r\n<li>Kentico Cloud<\/li>\r\n<li>Morweb<\/li>\r\n<li>Pimcore&nbsp;&nbsp;&nbsp;<\/li>\r\n<li>Plone<\/li>\r\n<li>Prismic<\/li>\r\n<li>Sitecore<\/li>\r\n<li>Solodev<\/li>\r\n<li><g class=\"gr_ gr_155 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del multiReplace\" id=\"155\" data-gr-id=\"155\">Storyblok<\/g><\/li>\r\n<li>Wordpress<\/li>\r\n<\/ul>\r\n<p>A quick review of features, capabilities, and price helped them narrow the list. The cost of the original 25 contenders ranged from open-source (technically free, though research says this is almost never the case), to $250k annually per solution. Those on the upper end of the price tier and those which did not compare well to their list of desired features and capabilities were immediately dismissed.<\/p>\r\n<p>Further research at this point showed us that not only are there hundreds of options, but that those options are divided into three primary types of solutions &ndash; Traditional, Decoupled, and Headless.<\/p>\r\n<h3><strong>Traditional<\/strong><\/h3>\r\n<p>Everything is combined in a single application: the content repository, back-end user interface for editors, templating system, as well as any custom code.&nbsp;<\/p>\r\n<h4><strong>Pros<\/strong><\/h4>\r\n<ul>\r\n<li>Single environment<\/li>\r\n<li>Built-in applications or easily-added applications that enhance the user experience (blogs, photo albums, etc.)<\/li>\r\n<li>Once installed by knowledgeable technicians, non-technical people can build websites<\/li>\r\n<li>Little technical experience required after the initial setup is complete<\/li>\r\n<\/ul>\r\n<h4><strong>Cons<\/strong><\/h4>\r\n<ul>\r\n<li>Content types and delivery channels are limited<\/li>\r\n<li>Limited programming framework<\/li>\r\n<li>More time and money required for customization, maintenance, and enhancements ($160k in the case of the campus instance of Drupal, along with additional staff person at $75k per year)<\/li>\r\n<li>Restricts what type of content (i.e. video, audio, advanced imagery, etc.) can publish and where that content can appear<\/li>\r\n<li>Creating front-end templates requires special knowledge<\/li>\r\n<li>The CMS code is exposed on the public server, increasing security risks<\/li>\r\n<\/ul>\r\n<p>Examples of Traditional CMS solutions include Drupal, Wordpress, and Joomla.<\/p>\r\n<h2><strong>Decoupled<\/strong><\/h2>\r\n<p>The back end (where content is created) and front end (where content is displayed) are housed separately. Decoupled is front-end agnostic and takes advantage of web services and API&rsquo;s to deliver content in its raw form to any front-end design anywhere. Many consider Decoupled to be the best of both worlds: you have templates and out-of-the-box functionality like a Traditional CMS, but the flexibility of a Headless implementation.&nbsp;<\/p>\r\n<h4><strong>Pros<\/strong><\/h4>\r\n<ul>\r\n<li>Fast and flexible content delivery with a specified delivery environment<\/li>\r\n<li>Rapid design iterations and simpler deployments<\/li>\r\n<li>Easy and secure third-party integrations<\/li>\r\n<li>Built-in application or easily added applications that enhance the user experience (blogs, photo albums, etc.)<\/li>\r\n<li>Fewer dependencies on IT<\/li>\r\n<li>Future-proof&nbsp;<\/li>\r\n<\/ul>\r\n<h4><strong>Cons<\/strong><\/h4>\r\n<ul>\r\n<li>Front-end development work required for design (if you don&rsquo;t have a front-end developer)<\/li>\r\n<\/ul>\r\n<p>Examples of Decoupled solutions include Brightspot, Contentful, and Agility<\/p>\r\n<h3><strong>Headless<\/strong><\/h3>\r\n<p>A Headless CMS makes the presentation layer much more flexible, as it eliminates the front-end part: by providing the content through its application program interface (API), it can be used on any platform and on any device (websites, apps, smartwatch, Alexa, Siri, Google Assistance devices, etc.) to retrieve and display the content.<\/p>\r\n<h4><strong>Pros<\/strong><\/h4>\r\n<ul>\r\n<li>Fast content delivery<\/li>\r\n<li>Provides complete control over how and where your content appears<\/li>\r\n<li>Easy and secure third-party integrations<\/li>\r\n<li>Allows developers to use their <g class=\"gr_ gr_185 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling multiReplace\" id=\"185\" data-gr-id=\"185\">favourite<\/g> tools and frameworks<\/li>\r\n<li>Future-proof<\/li>\r\n<\/ul>\r\n<h4><strong>Cons<\/strong><\/h4>\r\n<ul>\r\n<li>No presentation functionality<\/li>\r\n<li>Impossible to see an accurate live preview<\/li>\r\n<li>Reliant on additional technologies for its &lsquo;head&rsquo;<\/li>\r\n<\/ul>\r\n<p>Examples of Headless solutions include ButterCMS, Kentico Cloud, and ContentStack<\/p>\r\n<p>The more they researched, the more it became apparent that the current industry trend is moving away from a Traditional CMS in <g class=\"gr_ gr_186 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling multiReplace\" id=\"186\" data-gr-id=\"186\">favour<\/g> of hosted, cloud-based Decoupled or Headless solutions. They used this information and a more in-depth comparison of features, capabilities, and pricing to narrow their list to 5 final contenders: Agility CMS, ButterCMS, Contentful, Drupal, and Kentico Cloud.<span>&nbsp;<\/span><\/p>\r\n<h2>Recommendation<\/h2>\r\n<p>When considering <g class=\"gr_ gr_152 gr-alert gr_gramm gr_inline_cards gr_run_anim Grammar only-ins replaceWithoutSep\" id=\"152\" data-gr-id=\"152\">return<\/g> on investment (ROI) with regard to long-term cost savings, support, security, flexibility, scalability, and ease-of-use for MarCom and ease-of-development for IT, all research pointed to the selection of a decoupled solution. After extensive evaluation, Agility CMS was determined to be the best fit for CCPE.<\/p>\r\n<p>Agility CMS provides us with the flexibility of a headless solution, along with the benefits of a traditional CMS, which includes many built-in features. This solution will provide the quickest time to market, require the least amount of assistance from IT, be the simplest for MarCom to employ, and after all associated costs were considered, provide the greatest return on investment versus the other viable CMS candidates we evaluated.<\/p>\r\n<h3>Details<\/h3>\r\n<p><span>The evaluation team decided that Agility CMS would give them greater flexibility than the other systems they looked at.&nbsp;They will be able to easily adapt and add functionality to their site with their own team. It will make integrating with 3<sup>rd<\/sup>party systems like Higher Reach, Salesforce, and PeopleSoft seamless. &nbsp;If they were to use a hosted solution, one where the web site is hosted on external servers, they would not be able to integrate Higher Reach in the same manner they are now. Agility&rsquo;s architecture makes it possible for their team to create custom code that makes that integration possible, all while keeping the website hosted internally. Also, having full control of the web service, the web site code, and the content gives them the ability to handle current or future functionality that may be needed on the web site. <\/span><\/p>\r\n<p><span>Out of all the systems we reviewed and tested, Agility CMS stands out as the best integration of coding, design, and content management. It&rsquo;s built on a hybrid architecture blending both traditional and headless CMS concepts. With this, we get some of the web-centric functionality that will make development easier; while at the same time having the openness to use the data in any manner or mode we may need. In Agility, design and content can be separated in order to manage content without worrying about design; and with its integration with Visual Studio, the more technical aspects of the site can be accomplished without interfering with the design or content.&nbsp; In other words, we can develop the front end, back end, and content independently of each other, which minimizes downtime due to bottlenecks in the process. <\/span><\/p>\r\n<p><span>Agility is easy to implement and easy to use; the other systems either have a much higher learning curve or required extensive development work to build the site. You can create sites quickly with Agility&rsquo;s capability to develop websites through its browser-based interface. In our demo of Agility, we were able to re-create a large portion of our existing web site in a short period of time; the same cannot be said for the other systems we reviewed. Because of this, it will take much less effort, time, and cost to launch our new site. <\/span><\/p>\r\n<p><span>Agility CMS had some additional key features that aren&rsquo;t available in the other systems we reviewed.&nbsp; With the User Generated Content support feature in Agility, we can authorize users to create content on the live website without having to log in to the administrative interface. This will allow us to create the event calendars that currently exist on our site within the new system. We could also implement new features like allowing students who are studying abroad to have the ability to blog about their experience on our web site.&nbsp; Without this User Generated Content ability, functionality like the event calendar or student blogs would have to be built outside the web site. Agility has content import APIs that will allow us to sync data between Higher Reach and the Content Management system. As we add new courses to Higher Reach, we can have them automatically link to the content management system, as well as update data as things are changed.<\/span><\/p>\r\n<p><strong>Budget<\/strong><\/p>\r\n<p><span>We have carefully examined where the budget could be mined from existing software utilization and vendor agreements that we currently have in place. We no longer saw the need to continue on with HiR CRM (also known as JRM, whose contract has been <g class=\"gr_ gr_166 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling multiReplace\" id=\"166\" data-gr-id=\"166\">cancelled<\/g>). We have the expertise and the tools in place to accomplish what we need with Salesforce. We will continue with the use of the Higher Reach registration system (we had prepaid five years and we have to start paying the yearly license fee for this beginning in 2019), as well as our own customized developments in Salesforce, Pardot, and the Jenzabar Online Application system.&nbsp; <\/span><\/p>\r\n<p><span>We recommend using that savings to pay for Agility CMS for the web site. With a quote of $9,500 annually, Agility CMS will provide us a much higher return for our money.<\/span><\/p>\r\n<p><span>&nbsp;<\/span><\/p>"
}